# Duplicates

Exploring the repeating records with in the dataset.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../.warn-transformer/processed/consolidated.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39510 entries, 0 to 39509
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   company      39510 non-null  object
 1   hash_id      39510 non-null  object
 2   postal_code  39510 non-null  object
 3   location     35352 non-null  object
 4   jobs         34781 non-null  float64
 5   date         35795 non-null  object
dtypes: float64(1), object(5)
memory usage: 1.8+ MB

In [4]:
df.head()

,company,hash_id,postal_code,location,jobs,date
0,Bean’s Cafe,b855422a87ece9da20ec6571e2f8f6f48521d4e06610e5...,AK,Anchorage,40.0,2021-09-16
1,Kakivik Asset Mgmt,2214cbc57e63037a436152aeb018819a5e8777e2e8eab1...,AK,Prudhoe Bay,134.0,2021-07-02
2,First Student,20c76d62449eb697b6f95288b8982e36586afd99fc7b7c...,AK,"Fairbanks, North Pole",185.0,2021-04-30
3,GCI Communication Group,0ca0a89d9a684741de7f5199ef69ffc948b5df7e93e22c...,AK,Anchorage,59.0,2021-04-12
4,"RavnAir Group, Corvus Airlines, Hageland Aviat...",b7c5bb7e614fcce37f1f8c7ba00786faa5482270039b5c...,AK,"Anchorage and 20 smaller Alaska communities, p...",NaN,2020-09-30

In [5]:
dupes_df = df[df.duplicated()]

In [6]:
dupes_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 166 entries, 367 to 30048
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   company      166 non-null    object
 1   hash_id      166 non-null    object
 2   postal_code  166 non-null    object
 3   location     166 non-null    object
 4   jobs         165 non-null    float64
 5   date         59 non-null     object
dtypes: float64(1), object(5)
memory usage: 9.1+ KB

In [7]:
dupes_df.sort_values("hash_id").head()

,company,hash_id,postal_code,location,jobs,date
20793,Spartan Light Metal Products - Mexico,001f1fd9ad1edbca416fb47e84f51387a0161d9561a1f8...,MO,Mexico,332.0,NaN
20857,Enterprise Holdings - National and Alamo Rent ...,00615e29c56ff4a46a1c0de9fcd7a023b60e3141a1c800...,MO,Kansas City,84.0,NaN
20069,Commerce Corporation,01a93ea1aa834f89e8af754db49ef52822fa73e5c86be2...,MD,"7603 Energy Parkway, Baltimore, MD",NaN,2012-12-27
20808,Justin Retail,0247d1bfa9256b763989545228578abea24368747e457d...,MO,Monett (7) & Joplin (7),14.0,NaN
22804,NY Daily News -Liberty View Production Facility,035c1c8c3ecf3d8fc7078b674507a9c586b9839a3fc892...,NJ,Jersey City,224.0,2022-03-20

In [8]:
dupes_df.groupby("postal_code").size().rename("total").reset_index()

   postal_code  total
0           AL      1
1           CA     31
2           FL      1
3           GA      1
4           IA      1
5           IN      1
6           MD      1
7           MO    106
8           NE      4
9           NJ     15
10          OR      1
11          TX      3

In [9]:
dupes_df[dupes_df.postal_code == "AL"]

,company,hash_id,postal_code,location,jobs,date
367,FOOD WORLD,6ba1dec3f427574208540669deabfd72f8e1b010b09415...,AL,Mobile,55.0,2009-03-16

In [11]:
# df[df.company == "FOOD WORLD"]

Does the hashes works as a proxy for duplicates?

In [16]:
assert len(df.hash_id.unique()) == len(df) - len(dupes_df) == len(df.drop_duplicates())